// lib/src/constants/categories.dart

const List<String> kCategories = <String>[
  'Все',
  'Авто',
  'Запчасти',
  'Электроника',
  'Недвижимость',
  'Одежда',
  'Животные',
  'Красота и здоровье',
  'Спорт и отдых',
  'Работа',
  'Услуги',
  'Для дома и дачи',
  'Другое',
];

// ✅ ПОДКАТЕГОРИИ
const Map<String, List<String>> kSubcategories = <String, List<String>>{
  'Авто': [
    'Легковые автомобили',
    'Грузовики',
    'Мотоциклы',
    'Мопеды и скутеры',
    'Велосипеды',
  ],
  'Запчасти': [
    'Запчасти авто',
    'Шины',
    'Диски',
    'Аксессуары',
  ],
  'Электроника': [
    'Телефоны',
    'Компьютеры',
    'Ноутбуки',
    'Планшеты',
    'Наушники и аксессуары',
  ],
  'Недвижимость': [
    'Квартиры',
    'Дома',
    'Земельные участки',
    'Коммерческие помещения',
  ],
  'Одежда': [
    'Мужская одежда',
    'Женская одежда',
    'Детская одежда',
    'Обувь',
    'Аксессуары',
  ],
  'Животные': [
    'Собаки',
    'Кошки',
    'Лошади',
    'Коровы',
    'Птицы',
    'Рыбки и рептилии',
  ],
  'Красота и здоровье': [
    'Косметика',
    'Парфюмерия',
    'Спортивное питание',
    'Витамины',
    'Медицинские товары',
  ],
  'Спорт и отдых': [
    'Велосипеды',
    'Самокаты',
    'Роликовые коньки',
    'Спортивный инвентарь',
    'Туризм',
    'Лыжи и сноуборды',
  ],
  'Работа': [
    'Вакансии',
    'Резюме',
  ],
  'Услуги': [
    'Обучение',
    'Ремонт',
    'Доставка',
    'Красота',
    'Строительство',
  ],
  'Для дома и дачи': [
    'Мебель',
    'Бытовая техника',
    'Посуда',
    'Декор',
    'Строительные материалы',
  ],
};